{
    "hola": "Hola, ¿cómo estás?, espero que muy bien.\n\nMe presento, soy Pepis Plus, un bot de ayuda sobre el PEP.\n\nSi quieres saber más, escribe *menu*.",
    "menu": {
        "title": "📋 Menú de opciones:",
        "documento": "Si quieres obtener el documento del PEP, escribe *documento*.",
        "options": {
            "1": "¿Qué es el Proyecto Educativo del Programa (PEP) de Ingeniería de Sistemas?",
            "2": "¿Cuál es el propósito principal del PEP?",
            "3": "¿Para qué sirve el PEP en la formación de los estudiantes y en la gestión del programa?",
            "4": "¿Cuál es el código SNIES del programa de Ingeniería de Sistemas de la UFPS?",
            "5": "¿Qué normativa respalda la creación y funcionamiento del programa?",
            "6": "¿Qué nivel académico y título otorga el programa?",
            "7": "¿Cuántos créditos académicos tiene el programa de Ingeniería de Sistemas?",
            "8": "¿Cuál es la duración promedio del programa en semestres?",
            "9": "¿Cómo se relaciona el PEP con el Proyecto Educativo Institucional (PEI)?",
            "10": "¿En qué año se creó el programa de Ingeniería de Sistemas de la UFPS?",
            "11": "¿Qué hitos históricos son relevantes para el desarrollo del programa?",
            "12": "¿Qué metodologías de enseñanza se mencionan en el PEP?",
            "13": "¿Cómo se evalúa el impacto del PEP en la calidad educativa?",
            "14": "¿Cuáles son los valores fundamentales que fomenta el PEP?",
            "15": "¿Qué objetivos de desarrollo regional y nacional busca alcanzar el programa según el PEP?",
            "16": "¿Qué rol tiene el comité curricular en la implementación del PEP?",
            "17": "¿Qué áreas del conocimiento están incluidas en el núcleo básico del programa?",
            "18": "¿Cómo se describe el impacto social del programa en la región?",
            "19": "¿Qué acreditaciones ha recibido el programa a lo largo de su historia?",
            "20": "¿Qué aspectos legales y administrativos regulan el PEP y el programa?"
        }
    },
    "1": "Es el documento guía que define la misión, visión, objetivos y estrategias del programa de Ingeniería de Sistemas, alineado con las necesidades sociales y las políticas institucionales.",
    "2": "Garantizar la calidad educativa del programa mediante una planificación estratégica que asegure la coherencia entre las funciones de docencia, investigación, proyección social y gestión administrativa.",
    "3": "Sirve como herramienta para orientar el proceso formativo de los estudiantes, estableciendo competencias, metodologías y estrategias pedagógicas, además de guiar la toma de decisiones académicas y administrativas.",
    "4": "El código SNIES del programa es 856.",
    "5": "El programa está respaldado por normativas como la Ley 30 de 1992, el Decreto 1295 de 2010, el Acuerdo 277 de 1985 y las resoluciones del Ministerio de Educación Nacional (MEN).",
    "6": "El programa tiene nivel de pregrado y otorga el título de Ingeniero(a) de Sistemas.",
    "7": "El programa consta de 164 créditos académicos.",
    "8": "La duración promedio es de 10 semestres.",
    "9": "El PEP está alineado con el PEI de la universidad, compartiendo valores como la formación integral, la responsabilidad social y el compromiso con el desarrollo regional y nacional.",
    "10": "El programa fue creado en 1985.",
    "11": "Algunos hitos clave incluyen la obtención de su primera acreditación de alta calidad en 2013 y la renovación de su acreditación en 2018, además de las mejoras constantes en infraestructura y currículo.",
    "12": "Se destacan enfoques dialógicos y críticos, aprendizaje autónomo, el uso de laboratorios de informática, proyectos prácticos y una combinación equilibrada de teoría y práctica.",
    "13": "Se evalúa mediante procesos de autoevaluación y mejora continua, además de cumplir con estándares nacionales e internacionales de acreditación.",
    "14": "Respeto, honestidad, responsabilidad, tolerancia y lealtad, orientados al desarrollo ético y social de los estudiantes.",
    "15": "Busca formar profesionales capaces de aportar soluciones tecnológicas a problemas regionales y nacionales, promoviendo el desarrollo de la industria TI y la transformación digital.",
    "16": "El comité curricular define los lineamientos académicos del programa, supervisa el diseño curricular y promueve la mejora continua a través de evaluaciones periódicas.",
    "17": "Incluye ciencias básicas (matemáticas, física), ciencias de la ingeniería, tecnologías de la información, desarrollo de software y gestión de proyectos informáticos.",
    "18": "El programa contribuye al desarrollo social y económico formando ingenieros que lideran proyectos tecnológicos, resuelven problemas locales y potencian el uso de tecnologías de información.",
    "19": "Ha recibido acreditación de alta calidad en 2013 y su renovación en 2018, otorgadas por el MEN, reflejando su compromiso con estándares educativos elevados.",
    "20": "El programa está regulado por leyes nacionales (Ley 30 de 1992), decretos del MEN, y lineamientos institucionales como el Estatuto General de la UFPS y la Política Curricular."
}
